Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ИсторияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ИсторияСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрочитаноОператором</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЦитирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяМетка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDЦитируемогоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОчередьРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОчередьРаспределения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаБронирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПродлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнимПисалОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыйЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПараметрыОбщенияСБотом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПараметрыОбщенияСБотом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПараметрыОбщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСообщенияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСообщенияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_НастройкиОператоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_НастройкиОператоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОператоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧатов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНовыеЧаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПростойОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СостояниеБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СостояниеБота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПараметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПропускаемыеОператорыВОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПропускаемыеОператорыВОчереди</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ИсторияОтказовЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ИсторияОтказовЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПричиныОтклоненияОжидающихЧатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПричины</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСтатусыЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСтатусыЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОчереди</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СвязиПодразделенийСОператорами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СвязиПодразделенийСОператорами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_РаспределениеСервер/Ext/Module.bsl
Процедура ВыполнитьРегламентноеРаспределение() Экспорт
	
	//ПолучитьВременныеМеткиСообщений();
	
	ОбработатьТаймерыОчереди();
	
	РаспределитьОчередьЧатов();
	
КонецПроцедуры

Процедура ПолучитьВременныеМеткиСообщений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ИсторияСообщений.Чат КАК Чат,
	               |	iga_ИсторияСообщений.ДатаСообщения КАК Дата,
	               |	iga_ИсторияСообщений.IDСообщения КАК IDСообщения,
	               |	iga_ИсторияСообщений.Текст КАК Текст,
	               |	iga_ИсторияСообщений.ТипСообщения КАК ТипСообщения,
	               |	iga_ИсторияСообщений.ЭтоВходящее КАК ЭтоВходящее,
	               |	iga_ИсторияСообщений.Клиент КАК Клиент,
	               |	iga_ИсторияСообщений.ПутьКФайлу КАК ПутьКФайлу,
	               |	iga_ИсторияСообщений.ПрочитаноОператором КАК ПрочитаноОператором,
	               |	iga_ИсторияСообщений.ТекстЦитирования КАК ТекстЦитирования,
	               |	iga_ИсторияСообщений.АвторЦитирования КАК АвторЦитирования,
	               |	iga_ИсторияСообщений.Оператор КАК Оператор,
	               |	iga_ИсторияСообщений.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
	               |	iga_ИсторияСообщений.ВременнаяМетка КАК ВременнаяМетка,
	               |	iga_ИсторияСообщений.Чат.Идентификатор КАК ИдЧата
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |ГДЕ
	               |	iga_ИсторияСообщений.ВременнаяМетка = 0";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ДанныеСообщения = Бот.ПолучитьИнформациюОСообщении(Выборка.ИдЧата, Выборка.IDСообщения);
			ВременнаяМетка = ДанныеСообщения.timestamp;
		Исключение
			Продолжить;
		КонецПопытки;
		
		Запись = РегистрыСведений.iga_ИсторияСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ВременнаяМетка = ВременнаяМетка;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьТаймерыОчереди() Экспорт
	
	ТекущееВремя = ТекущаяДатаСеанса();
	
	ЛимитАктивностиМин = Константы.iga_ВремяМаксимальнойАктивностиЧата.Получить();
	ЛимитАктивностиМин = ?(ЗначениеЗаполнено(ЛимитАктивностиМин), ЛимитАктивностиМин, 60);
	
	ЛимитОжиданияСоединения = Константы.iga_ВремяОжиданияПодтвержденияСоединения.Получить();
	ЛимитОжиданияСоединения = ?(ЗначениеЗаполнено(ЛимитОжиданияСоединения), ЛимитОжиданияСоединения, 10);
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Запрос = Новый Запрос;
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.iga_СтатусыОчереди.Подключение);
	Статусы.Добавить(Перечисления.iga_СтатусыОчереди.ВРаботе);
	Статусы.Добавить(Перечисления.iga_СтатусыОчереди.ЗапросСоединения);
	Статусы.Добавить(Перечисления.iga_СтатусыОчереди.ОбщениеСБотом);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Очередь.Чат КАК Чат,
		|	Очередь.Оператор КАК Оператор,
		|	Очередь.Статус КАК Статус,
		|	Очередь.ДатаКонцаБронирования КАК ДатаКонцаБронирования,
		|	Очередь.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
		|	Очередь.ДатаПоступления КАК ДатаПоступления,
		|	Очередь.ОсобыйЧат КАК ОсобыйЧат,
		|	Очередь.Чат.Идентификатор КАК ЧатИдентификатор,
		|	ЕСТЬNULL(iga_ПараметрыОбщенияСБотом.Значение, НЕОПРЕДЕЛЕНО) КАК ВыбранноеПодразделение,
		|	РАЗНОСТЬДАТ(ЕСТЬNULL(iga_ПоследниеСообщенияЧатов.ДатаСообщения, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, ЧАС) >= 24 КАК Прошло24Часа,
		|	iga_НастройкиОператоров.Статус КАК СтатусОператора,
		|	РАЗНОСТЬДАТ(ЕСТЬNULL(iga_ПоследниеСообщенияЧатов.ДатаСообщения, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, МИНУТА) > 60 КАК ПрошлоБолее1Часа
		|ПОМЕСТИТЬ ВТ_ТекущаяОчередь
		|ИЗ
		|	РегистрСведений.iga_ОчередьРаспределения КАК Очередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
		|		ПО Очередь.Чат = iga_ПараметрыОбщенияСБотом.Чат
		|			И (iga_ПараметрыОбщенияСБотом.Параметр.ИмяПараметра = ""ВыбранноеПодразделение"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
		|		ПО Очередь.Чат = iga_ПоследниеСообщенияЧатов.Чат
		|			И (iga_ПоследниеСообщенияЧатов.ЭтоВходящее)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
		|		ПО Очередь.Оператор = iga_НастройкиОператоров.Оператор
		|ГДЕ
		|	Очередь.Статус В(&Статусы)
		|	И НЕ Очередь.ОсобыйЧат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТекущаяОчередь.Чат КАК Чат,
		|	ВТ_ТекущаяОчередь.Оператор КАК Оператор,
		|	ВТ_ТекущаяОчередь.Статус КАК Статус,
		|	ВТ_ТекущаяОчередь.ДатаКонцаБронирования КАК ДатаКонцаБронирования,
		|	ВТ_ТекущаяОчередь.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
		|	ВТ_ТекущаяОчередь.ДатаПоступления КАК ДатаПоступления,
		|	ВТ_ТекущаяОчередь.ОсобыйЧат КАК ОсобыйЧат,
		|	ВТ_ТекущаяОчередь.ЧатИдентификатор КАК ЧатИдентификатор,
		|	ВТ_ТекущаяОчередь.ВыбранноеПодразделение КАК ВыбранноеПодразделение,
		|	ВТ_ТекущаяОчередь.Прошло24Часа КАК Прошло24Часа,
		|	ВТ_ТекущаяОчередь.СтатусОператора КАК СтатусОператора,
		|	ВТ_ТекущаяОчередь.ПрошлоБолее1Часа КАК ПрошлоБолее1Часа
		|ИЗ
		|	ВТ_ТекущаяОчередь КАК ВТ_ТекущаяОчередь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	iga_ПараметрыОбщенияСБотом.Чат КАК Чат,
		|	iga_ПараметрыОбщенияСБотом.Параметр КАК Параметр,
		|	iga_ПараметрыОбщенияСБотом.Значение КАК Значение,
		|	iga_ПараметрыОбщенияСБотом.Параметр.ИмяПараметра КАК ИмяПараметра
		|ИЗ
		|	ВТ_ТекущаяОчередь КАК ВТ_ТекущаяОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
		|		ПО ВТ_ТекущаяОчередь.Чат = iga_ПараметрыОбщенияСБотом.Чат
		|ИТОГИ ПО
		|	Чат";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаОчереди = ПакетРезультатов.Получить(1).Выбрать();
	
	ВыборкаПараметровПоЧатам = ПакетРезультатов.Получить(2).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПараметрыЧата = Новый Структура;
	
	Пока ВыборкаОчереди.Следующий() Цикл
		
		Если ВыборкаОчереди.ОсобыйЧат Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаПараметровПоЧатам.НайтиСледующий(ВыборкаОчереди.Чат, "Чат") Тогда
			ПараметрыЧата.Очистить();
			ВыборкаПараметров = ВыборкаПараметровПоЧатам.Выбрать();
			Пока ВыборкаПараметров.Следующий() Цикл
				ПараметрыЧата.Вставить(ВыборкаПараметров.ИмяПараметра, ВыборкаПараметров.Значение);
			КонецЦикла;
		КонецЕсли;
		
		
		Если ВыборкаОчереди.Статус = Перечисления.iga_СтатусыОчереди.ОбщениеСБотом Тогда
			Если ВыборкаОчереди.ПрошлоБолее1Часа Тогда
				Если Не ПараметрыЧата.Свойство("Язык") Тогда
					iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ВыборкаОчереди.Чат, "Язык", Справочники.iga_ЯзыкиЧатов.Русский);
				КонецЕсли;;
				
				ЗаписьСостоянияБота = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
				ЗаписьСостоянияБота.Чат = ВыборкаОчереди.Чат;
				ЗаписьСостоянияБота.Прочитать();
				Если ЗаписьСостоянияБота.Выбран() Тогда
					ЗаписьСостоянияБота.Удалить();
				КонецЕсли;
				
				ПараметрыСброса = Новый Структура("ЧатСсылка", ВыборкаОчереди.Чат);
				СброситьЧатВОбщуюОчередь(ПараметрыСброса, Неопределено, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаОчереди.Статус = Перечисления.iga_СтатусыОчереди.Подключение 
			И ВыборкаОчереди.ДатаКонцаБронирования < ТекущееВремя И Не (ВыборкаОчереди.Прошло24Часа И ВыборкаОчереди.СтатусОператора = Перечисления.iga_СтатусыОператоров.Онлайн) Тогда
			
			ЗафиксироватьОтказОператора(ВыборкаОчереди.Чат, ВыборкаОчереди.Оператор, Справочники.iga_ПричиныОтклоненияОжидающихЧатов.Просрочено,
				"Оператор не принял запрос ожидающего подключения.");
			
			ПараметрыСброса = Новый Структура("ЧатСсылка, ВыбранноеПодразделение, Причина", ВыборкаОчереди.Чат, ВыборкаОчереди.ВыбранноеПодразделение, Справочники.iga_ПричиныОтклоненияОжидающихЧатов.Просрочено);
			
			СброситьЧатВОбщуюОчередь(ПараметрыСброса, ВыборкаОчереди.Оператор, Истина);
			
			ЗаписьПропуска = РегистрыСведений.iga_ПропускаемыеОператорыВОчереди.СоздатьМенеджерЗаписи();
			ЗаписьПропуска.Оператор = ВыборкаОчереди.Оператор;
			ЗаписьПропуска.Чат = ВыборкаОчереди.Чат;
			ЗаписьПропуска.Записать();
			
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаОчереди.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе И Не (ВыборкаОчереди.Прошло24Часа И ВыборкаОчереди.СтатусОператора = Перечисления.iga_СтатусыОператоров.Онлайн) Тогда
			
			ВремяИстеченияАктивностиПользователя = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ВыборкаОчереди.ДатаПоследнейАктивности, "МИНУТА", ЛимитАктивностиМин);
			
			ВремяИстеченияАктивностиОператора = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ВыборкаОчереди.ДатаПоследнейАктивности, "МИНУТА", 15);
			
			ПоследнимПисалКлиент = ОпределитьПоследнегоВЧате(ВыборкаОчереди.Чат);
			
			iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ВыборкаОчереди.Чат, "БезОповещения", Истина);

			Если ПоследнимПисалКлиент И ВремяИстеченияАктивностиОператора < ТекущееВремя Тогда 
				//КодЯзыка = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ВыборкаОчереди.Чат, "Язык");
				
				ЗафиксироватьОтказОператора(ВыборкаОчереди.Чат, ВыборкаОчереди.Оператор, Справочники.iga_ПричиныОтклоненияОжидающихЧатов.Просрочено,
				"Оператор не ответил в чат за отведенное для этого время.");
				
				ПараметрыСброса = Новый Структура("ЧатСсылка, ВыбранноеПодразделение, Причина", ВыборкаОчереди.Чат, ВыборкаОчереди.ВыбранноеПодразделение, Справочники.iga_ПричиныОтклоненияОжидающихЧатов.Просрочено);
				
				СброситьЧатВОбщуюОчередь(ПараметрыСброса, ВыборкаОчереди.Оператор, Истина);
				
			ИначеЕсли Не ПоследнимПисалКлиент И ВремяИстеченияАктивностиПользователя < ТекущееВремя Тогда 
				//КодЯзыка = ПараметрыЧата.Язык;
				
				УстановитьСтатусЗавершен(ВыборкаОчереди.Чат, ВыборкаОчереди.Оператор);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗафиксироватьОтказОператора(ЧатСсылка, СсылкаОператор, Причина, ТекстПричины = "") Экспорт
	Менеджер = РегистрыСведений.iga_ИсторияОтказовЧатов.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ЧатСсылка;
	Менеджер.Оператор = СсылкаОператор;
	Менеджер.Дата = ТекущаяДатаСеанса();
	
	Менеджер.ПричинаОтказа = Причина;
	Менеджер.ТекстПричины = ТекстПричины;
	Менеджер.Записать();
	
КонецПроцедуры

Функция ОтклонитьЧатНаСервере(ПараметрыОтклонения, ТекущийОператор, ТекстПричины) Экспорт
	
	ЗаписьОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	ЗаписьОчереди.Чат = ПараметрыОтклонения.ЧатСсылка;
	ЗаписьОчереди.Оператор = ТекущийОператор;
	ЗаписьОчереди.Прочитать();
	
	Если ЗаписьОчереди.Выбран() И (ЗаписьОчереди.Статус = Перечисления.iga_СтатусыОчереди.Подключение
		ИЛИ ЗаписьОчереди.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе) Тогда
		
		ЗафиксироватьОтказОператора(ПараметрыОтклонения.ЧатСсылка, ТекущийОператор, 
			ПараметрыОтклонения.Причина, ТекстПричины);
			
		Если ПараметрыОтклонения.Свойство("СвойстваПричины") И ПараметрыОтклонения.СвойстваПричины.ЗавершитьЧат Тогда
			ЗаписьОчереди.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
			ЗаписьОчереди.Записать();
			iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ПараметрыОтклонения.ЧатСсылка, "БезОповещения", Истина);
		Иначе
			СброситьЧатВОбщуюОчередь(ПараметрыОтклонения, ТекущийОператор, Истина);
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Процедура СброситьЧатВОбщуюОчередь(ПараметрыОтклонения, ТекущийОператор, БезОповвещения = Ложь)
	
	Если ЗначениеЗаполнено(ТекущийОператор) Тогда
		Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Менеджер.Чат = ПараметрыОтклонения.ЧатСсылка;
		Менеджер.Оператор = ТекущийОператор;
		Менеджер.Прочитать();
		ДатаПоступления = Менеджер.ДатаПоступления;
	Иначе
		ДатаПоступления = ТекущаяДата();
	КонецЕсли;
	
	УстановитьСтатусЗавершен(ПараметрыОтклонения.ЧатСсылка, ТекущийОператор);
	
	Если ПараметрыОтклонения.Свойство("ВыбранноеПодразделение") Тогда
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ПараметрыОтклонения.ЧатСсылка, "ВыбранноеПодразделение", ПараметрыОтклонения.ВыбранноеПодразделение);
	КонецЕсли;
	
	Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ПараметрыОтклонения.ЧатСсылка;
	Менеджер.Оператор = Неопределено;
	Менеджер.Статус = Перечисления.iga_СтатусыОчереди.Ожидание;
	Менеджер.ДатаПоступления = ДатаПоступления;
	Если ПараметрыОтклонения.Свойство("Причина") 
		И ПараметрыОтклонения.Причина = Справочники.iga_ПричиныОтклоненияОжидающихЧатов.ТребуетсяВмешательствоРуководства Тогда
		Менеджер.ОсобыйЧат = Истина;
	КонецЕсли;
	Менеджер.БезОповещения = БезОповвещения;
	Менеджер.Записать();
	
	Менеджер = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ПараметрыОтклонения.ЧатСсылка;
	Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.Ожидание;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура УстановитьСтатусЗавершен(ЧатСсылка, СсылкаОператор)
	Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ЧатСсылка;
	Менеджер.Оператор = СсылкаОператор;
	Менеджер.Прочитать();
	Если Менеджер.Выбран() Тогда
		Менеджер.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
		Менеджер.ДатаПоступления = ТекущаяДата();
		Менеджер.Записать();
		
		Менеджер = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
		Менеджер.Чат = ЧатСсылка;
		Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.Завершен;
		Менеджер.Записать();
	КонецЕсли;
КонецПроцедуры

Функция ОпределитьПоследнегоВЧате(ЧатСсылка)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	iga_ИсторияСообщений.ЭтоВходящее КАК ЭтоВходящее
	                      |ИЗ
	                      |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	                      |ГДЕ
	                      |	iga_ИсторияСообщений.Чат = &Чат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	iga_ИсторияСообщений.ВременнаяМетка УБЫВ");
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ЭтоВходящее, Ложь);
КонецФункции

Процедура РаспределитьОчередьЧатов() Экспорт
	
	МинутыШтрафаОтказ = Константы.iga_ШтрафноеВремяПропускаЧата.Получить();
	МинутыШтрафаОтказ = ?(ЗначениеЗаполнено(МинутыШтрафаОтказ), МинутыШтрафаОтказ, 1);
	
	ЛимитЧатовВПакете = 5;
	СекундПаузы = 120; 
	ГраницаВремениПаузы = ТекущаяДата() - СекундПаузы;
	
	ЗапросЧаты = Новый Запрос;
	ЗапросЧаты.Текст = 
		"ВЫБРАТЬ
		|	Очередь.Чат КАК Чат,
		|	Параметры.Параметр.ИмяПараметра КАК ИмяПараметра,
		|	ЕСТЬNULL(Параметры.Значение, """") КАК ЗначениеПараметра,
		|	Очередь.ОсобыйЧат КАК ОсобыйЧат,
		|	Очередь.БезОповещения КАК БезОповещения,
		|	Очередь.ДатаПоступления КАК ДатаПоступления
		|ИЗ
		|	РегистрСведений.iga_ОчередьРаспределения КАК Очередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК Параметры
		|		ПО Очередь.Чат = Параметры.Чат
		|ГДЕ
		|	Очередь.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.Ожидание)
		|	
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоступления
		|ИТОГИ
		|	МАКСИМУМ(ОсобыйЧат),
		|	МАКСИМУМ(БезОповещения)
		|ПО
		|	Очередь.Чат";
	
	РезультатЧаты = ЗапросЧаты.Выполнить();
	Если РезультатЧаты.Пустой() Тогда 
		Возврат; 
	КонецЕсли;
	ВыборкаЧатов = РезультатЧаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//ЗапросВсеШтрафы = Новый Запрос("ВЫБРАТЬ
	//                               |	iga_ИсторияОтказовЧатов.Чат КАК Чат,
	//                               |	iga_ИсторияОтказовЧатов.Оператор КАК Оператор
	//                               |ИЗ
	//                               |	РегистрСведений.iga_ИсторияОтказовЧатов КАК iga_ИсторияОтказовЧатов
	//                               |ГДЕ
	//                               |	iga_ИсторияОтказовЧатов.Дата > &МинутаНазад");
	//ЗапросВсеШтрафы.УстановитьПараметр("МинутаНазад", ТекущаяДата() - (60 * МинутыШтрафаОтказ));
	//ТаблицаШтрафов = ЗапросВсеШтрафы.Выполнить().Выгрузить();
	//ТаблицаШтрафов.Индексы.Добавить("Чат,Оператор");
	ТаблицаШтрафов = Новый ТаблицаЗначений;

	ЗапросОператоры = Новый Запрос;
	ЗапросОператоры.Текст =
	"ВЫБРАТЬ
	|	iga_ОчередьРаспределения.Оператор КАК Оператор,
	|	ВложенныйЗапрос.КолвоВсего КАК КолвоВсего,
	|	ВложенныйЗапрос.КолвоНедавних КАК КолвоНедавних,
	|	МАКСИМУМ(iga_ОчередьРаспределения.ДатаПоступления) КАК ДатаПоследнего
	|ПОМЕСТИТЬ ВТ_АктивныеОператоры
	|ИЗ
	|	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			iga_ОчередьРаспределения.Оператор КАК Оператор,
	|			КОЛИЧЕСТВО(iga_ОчередьРаспределения.Чат) КАК КолвоВсего,
	|			СУММА(ВЫБОР
	|					КОГДА iga_ОчередьРаспределения.ДатаПоступления > &ГраницаВремени
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК КолвоНедавних
	|		ИЗ
	|			РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	|		ГДЕ
	|			iga_ОчередьРаспределения.Статус В (ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.ВРаботе), ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.Подключение))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			iga_ОчередьРаспределения.Оператор) КАК ВложенныйЗапрос
	|		ПО iga_ОчередьРаспределения.Оператор = ВложенныйЗапрос.Оператор
	|
	|СГРУППИРОВАТЬ ПО
	|	iga_ОчередьРаспределения.Оператор,
	|	ВложенныйЗапрос.КолвоВсего,
	|	ВложенныйЗапрос.КолвоНедавних";
						   
	ЗапросОператоры.Текст = ЗапросОператоры.Текст + "; " +
	"ВЫБРАТЬ
	|	Настройки.Оператор КАК Оператор,
	|	Настройки.ЛимитЧатов КАК Лимит,
	|	ЕСТЬNULL(Активные.КолвоВсего, 0) КАК ТекущееКолво,
	|	ЕСТЬNULL(Активные.КолвоНедавних, 0) КАК КолвоНедавних,
	|	ЕСТЬNULL(Активные.ДатаПоследнего, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнего,
	|	Настройки.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Настройки.Подразделение = ЗНАЧЕНИЕ(Справочник.iga_ПодразделенияОператоров.КоллЦентр)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТипОператора,
	|	Настройки.ПростойОператор КАК ПростойОператор
	|ПОМЕСТИТЬ ВТ_ДоступныеОператоры
	|ИЗ
	|	РегистрСведений.iga_НастройкиОператоров КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктивныеОператоры КАК Активные
	|		ПО Настройки.Оператор = Активные.Оператор
	|ГДЕ
	|	Настройки.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОператоров.Онлайн)
	|	И (//ЕСТЬNULL(Активные.КолвоВсего, 0) < Настройки.ЛимитЧатов И 
	|				Настройки.ПриниматьНовыеЧаты
	|			ИЛИ НЕ Настройки.ПростойОператор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоступныеОператоры.Оператор КАК Оператор,
	|	ВТ_ДоступныеОператоры.Лимит КАК Лимит,
	|	ВТ_ДоступныеОператоры.ТекущееКолво КАК ТекущееКолво,
	|	ВТ_ДоступныеОператоры.КолвоНедавних КАК КолвоНедавних,
	|	ВТ_ДоступныеОператоры.ДатаПоследнего КАК ДатаПоследнего,
	|	ВТ_ДоступныеОператоры.Подразделение КАК Подразделение,
	|	ВТ_ДоступныеОператоры.ТипОператора КАК ТипОператора,
	|	ВТ_ДоступныеОператоры.ПростойОператор КАК ПростойОператор
	|ИЗ
	|	ВТ_ДоступныеОператоры КАК ВТ_ДоступныеОператоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	iga_СвязиПодразделенийСОператорами.Оператор КАК Оператор,
	|	iga_СвязиПодразделенийСОператорами.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_ДоступныеОператоры КАК ВТ_ДоступныеОператоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_СвязиПодразделенийСОператорами КАК iga_СвязиПодразделенийСОператорами
	|		ПО ВТ_ДоступныеОператоры.Оператор = iga_СвязиПодразделенийСОператорами.Оператор";
	
	ЗапросОператоры.УстановитьПараметр("ГраницаВремени", ГраницаВремениПаузы);
	
	ПакетРезультатов = ЗапросОператоры.ВыполнитьПакет();
	
	ТаблицаОператоров = ПакетРезультатов.Получить(2).Выгрузить();;
	ТаблицаОператоров.Сортировать("ТипОператора, ДатаПоследнего");
	
	ТаблицаПодразделений = ПакетРезультатов.Получить(3).Выгрузить();
	
	СтруктураПоиска = Новый Структура("ИмяПараметра");
	
	СтруктураПоискаПодразделений = Новый Структура("Оператор, Подразделение");
	
	Пока ВыборкаЧатов.Следующий() Цикл
		
		РаспределеноПрофильным = Ложь;
		
		ВыбранноеПодразделение = Неопределено;
		
		ВыборкаПараметров = ВыборкаЧатов.Выбрать();
		
		РаспределитьВсемОператорам = Ложь;
		
		СтруктураПоиска.ИмяПараметра = "ВыбранноеПодразделение";
		Если ВыборкаПараметров.НайтиСледующий(СтруктураПоиска) Тогда
			ВыбранноеПодразделение = ВыборкаПараметров.ЗначениеПараметра;
		КонецЕсли;
		ВыборкаПараметров.Сбросить();
		СтруктураПоиска.ИмяПараметра = "РаспределитьВсемОператорам";
		Если ВыборкаПараметров.НайтиСледующий(СтруктураПоиска) Тогда
			РаспределитьВсемОператорам = ВыборкаПараметров.ЗначениеПараметра;
		КонецЕсли;
		
		Если Не ВыборкаЧатов.ОсобыйЧат И Не РаспределитьВсемОператорам Тогда
		
			Если ЗначениеЗаполнено(ВыбранноеПодразделение) Тогда
				ЕстьПрофильныеОператорыСМестом = Ложь;
				ЕстьСвободныеПрофильные        = Ложь;
				Для Каждого СтрОп Из ТаблицаОператоров Цикл
					Если СтрОп.Подразделение = ВыбранноеПодразделение Тогда
						Если СтрОп.ТекущееКолво < СтрОп.Лимит Тогда
							ЕстьПрофильныеОператорыСМестом = Истина;
							Если СтрОп.КолвоНедавних < ЛимитЧатовВПакете Тогда
								ЕстьСвободныеПрофильные = Истина; 
								Прервать; 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если ЕстьПрофильныеОператорыСМестом И Не ЕстьСвободныеПрофильные Тогда 
					Продолжить; 
				КонецЕсли;
			КонецЕсли;     
		КонецЕсли;

		ОператорНазначен = Ложь;
		
		Для Каждого СтрОператор Из ТаблицаОператоров Цикл
			
			ЗаписьПропуска = РегистрыСведений.iga_ПропускаемыеОператорыВОчереди.СоздатьМенеджерЗаписи();
			ЗаписьПропуска.Чат = ВыборкаЧатов.Чат;
			ЗаписьПропуска.Оператор = СтрОператор.Оператор;
			ЗаписьПропуска.Прочитать();
			
			Если ЗаписьПропуска.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаЧатов.ОсобыйЧат Тогда
				Если СтрОператор.ПростойОператор Тогда
					Продолжить;
				КонецЕсли;
				
				НазначитьОператораЧату(ВыборкаЧатов.Чат, СтрОператор.Оператор, Истина);
				ОператорНазначен = Истина;
				Прервать;
				
			КонецЕсли;
			
			Если Не СтрОператор.ПростойОператор Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не РаспределитьВсемОператорам И (СтрОператор.КолвоНедавних >= ЛимитЧатовВПакете Или СтрОператор.ТекущееКолво >= СтрОператор.Лимит) Тогда 
				Продолжить; 
			КонецЕсли;
			
			//ПараметрыПоиска = Новый Структура("Чат, Оператор", ВыборкаЧатов.Чат, СтрОператор.Оператор);
			//Если ТаблицаШтрафов.НайтиСтроки(ПараметрыПоиска).Количество() > 0 Тогда 
			//	Продолжить; 
			//КонецЕсли;
			
			ПодходитПоПодразделению = (СтрОператор.Подразделение = ВыбранноеПодразделение);
			
			СтруктураПоискаПодразделений.Оператор = СтрОператор.Оператор;
			СтруктураПоискаПодразделений.Подразделение = ВыбранноеПодразделение;
			
			НайденныеСтроки = ТаблицаПодразделений.НайтиСтроки(СтруктураПоискаПодразделений);
			
			Если Не ПодходитПоПодразделению Тогда
				ПодходитПоПодразделению = НайденныеСтроки.Количество() > 0;
			КонецЕсли;
			
			ЭтоКоллЦентр = СтрОператор.Подразделение = Справочники.iga_ПодразделенияОператоров.КоллЦентр;
			
			Если ПодходитПоПодразделению Или ЭтоКоллЦентр Тогда 
				
				Если РаспределитьВсемОператорам И РаспределеноПрофильным И ЭтоКоллЦентр Тогда
					Прервать;
				КонецЕсли;
				
				Если ПодходитПоПодразделению Тогда
					РаспределеноПрофильным = Истина;
				КонецЕсли;
				
				НазначитьОператораЧату(ВыборкаЧатов.Чат, СтрОператор.Оператор,, ВыборкаЧатов.БезОповещения);
				ОператорНазначен = Истина;
				
				СтрОператор.ТекущееКолво   = СтрОператор.ТекущееКолво + 1;
				СтрОператор.КолвоНедавних  = СтрОператор.КолвоНедавних + 1;
				СтрОператор.ДатаПоследнего = ТекущаяДата();
				Если Не РаспределитьВсемОператорам Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ОператорНазначен Тогда
			ЗаписиПропуска = РегистрыСведений.iga_ПропускаемыеОператорыВОчереди.СоздатьНаборЗаписей();
			ЗаписиПропуска.Отбор.Чат.Установить(ВыборкаЧатов.Чат);
			ЗаписиПропуска.Записать();
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура НазначитьОператораЧату(ЧатСсылка, СсылкаОператор, ОсобыйЧат = Ложь, БезОповещения = Ложь)
    
    ВремяНаПринятие = Константы.iga_ВремяОжиданияПодключения.Получить() * 60;
	ВремяНаПринятие = ?(ЗначениеЗаполнено(ВремяНаПринятие), ВремяНаПринятие, 300);
	
	МенеджерОжидания = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	МенеджерОжидания.Чат = ЧатСсылка;
	МенеджерОжидания.Прочитать();
	
    Набор = РегистрыСведений.iga_ОчередьРаспределения.СоздатьНаборЗаписей();
    Набор.Отбор.Чат.Установить(ЧатСсылка);
    Набор.Отбор.Оператор.Установить(Неопределено);
    Набор.Записать();
    
    Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
    Менеджер.Чат = ЧатСсылка;
    Менеджер.Оператор = СсылкаОператор;
    Менеджер.Статус = Перечисления.iga_СтатусыОчереди.Подключение;
    Менеджер.ДатаПоступления = ?(ЗначениеЗаполнено(МенеджерОжидания.ДатаПоступления), МенеджерОжидания.ДатаПоступления, ТекущаяДата());
    Менеджер.ДатаКонцаБронирования = ТекущаяДата() + ВремяНаПринятие;
    
    Менеджер.ДатаПоследнейАктивности = ТекущаяДата(); 
	Менеджер.ОсобыйЧат = ОсобыйЧат;
	Менеджер.БезОповещения = БезОповещения;
    
    Менеджер.Записать();
	
	Менеджер = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ЧатСсылка;
	Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.Подключение;
	Менеджер.Записать();
	
КонецПроцедуры

Функция ПродлитьВремяОжидания(ЧатСсылка, ТекущийОператор) Экспорт
	
	Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ЧатСсылка;
	Менеджер.Оператор = ТекущийОператор;
	Менеджер.Прочитать();
	
	Если Менеджер.Выбран() И Не Менеджер.ВремяПродлено Тогда
		
		МаксимальноеПродление = Константы.iga_МаксимальноеВремяПродленияОжидания.Получить() * 60;
		
		МаксимальноеПродление = ?(ЗначениеЗаполнено(МаксимальноеПродление), МаксимальноеПродление, 300);
		
		ДопВремя = МаксимальноеПродление;
		Менеджер.ДатаКонцаБронирования = Менеджер.ДатаКонцаБронирования + ДопВремя;
		Менеджер.ВремяПродлено = Истина; 
		Менеджер.Записать();
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СформироватьHTMLДиалога(ЧатСсылка, КэшКонтента, УникальныйИдентификаторФормы, КэшСкрипта = "", КоличествоСообщений = 20) Экспорт
    
	HTML_Код = Обработки.iga_ChatBot.ПолучитьМакет("HTMLДиалогПереписки").ПолучитьТекст();
	
	КэшЧата =  КэшКонтента.Получить(ЧатСсылка);
	
	Если КэшЧата = Неопределено Тогда
		КэшЧата = Новый Соответствие;
		КэшКонтента.Вставить(ЧатСсылка, КэшЧата);
	КонецЕсли;
	
	Если КэшКонтента.Получить("КартинкаЛупа") = Неопределено Тогда
		ДвоичныеДанные = Обработки.iga_ChatBot.ПолучитьМакет("КартинкаЛупа");
		АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);
		КэшКонтента.Вставить("КартинкаЛупа", АдресКартинки);;
	КонецЕсли;
	
	Если КэшКонтента.Получить("КартинкаПлей") = Неопределено Тогда
		ДвоичныеДанные = Обработки.iga_ChatBot.ПолучитьМакет("КартинкаПлей");
		АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);
		КэшКонтента.Вставить("КартинкаПлей", АдресКартинки);;
	КонецЕсли;
	
	Если КэшКонтента.Получить("КартинкаСкачать") = Неопределено Тогда
		ДвоичныеДанные = Обработки.iga_ChatBot.ПолучитьМакет("КартинкаСкачать");
		АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);
		КэшКонтента.Вставить("КартинкаСкачать", АдресКартинки);;
	КонецЕсли;

    HTML_Код = СтрЗаменить(HTML_Код, "#АдресКартинкиПлей", КэшКонтента.Получить("КартинкаПлей"));
    HTML_Код = СтрЗаменить(HTML_Код, "#АдресКартинкиЛупа", КэшКонтента.Получить("КартинкаЛупа"));
    HTML_Код = СтрЗаменить(HTML_Код, "#АдресКартинкиСкачать", КэшКонтента.Получить("КартинкаСкачать"));
	
	ПутьКСкриптуПоУмолчанию = Константы.iga_ПутьКСкриптуЭмодзи.Получить();
	                            
	Если ПутьКСкриптуПоУмолчанию = "" Тогда
		ПутьКСкриптуПоУмолчанию = "https://cdn.jsdelivr.net/npm/@twemoji/api@latest/dist/twemoji.min.js";
	КонецЕсли;
	
    HTML_Код = СтрЗаменить(HTML_Код, "#СсылкаНаСкрипт", ПутьКСкриптуПоУмолчанию);

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ВложенныйЗапрос.Текст КАК Текст,
        |	ВложенныйЗапрос.Дата КАК Дата,
        |	ВложенныйЗапрос.IDСообщения КАК IDСообщения,
        |	ВложенныйЗапрос.ЭтоВходящее КАК ЭтоВходящее,
        |	ВложенныйЗапрос.ТипСообщения КАК ТипСообщения,
        |	ВложенныйЗапрос.ОператорИмя КАК ОператорИмя,
        |	ВложенныйЗапрос.ТекстЦитирования КАК ТекстЦитирования,
        |	ВложенныйЗапрос.АвторЦитирования КАК АвторЦитирования,
        |	ВложенныйЗапрос.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
        |	ВложенныйЗапрос.ВременнаяМетка КАК ВременнаяМетка,
        |	ВложенныйЗапрос.ПрочитаноОператором КАК ПрочитаноОператором,
        |	iga_ПрикрепленныеФайлы.Статус КАК СтатусФайла,
        |	iga_ПрикрепленныеФайлы.ТипМедиа КАК ТипМедиа,
        |	iga_ПрикрепленныеФайлы.КартинкаФайла КАК КартинкаФайла,
        |	iga_ПрикрепленныеФайлы.ИмяФайла КАК ИмяФайла,
        |	iga_ПрикрепленныеФайлы.РазмерФайла КАК РазмерФайла,
        |	ВложенныйЗапрос.ЕстьФайл
        |		И НЕ iga_ПрикрепленныеФайлы.ИмяФайла ЕСТЬ NULL КАК ЕстьФайл
        |ИЗ
        |	(ВЫБРАТЬ ПЕРВЫЕ 999
        |		История.Текст КАК Текст,
        |		История.ДатаСообщения КАК Дата,
        |		История.IDСообщения КАК IDСообщения,
        |		История.ЭтоВходящее КАК ЭтоВходящее,
        |		История.ТипСообщения КАК ТипСообщения,
        |		ЕСТЬNULL(История.Оператор.Наименование, """") КАК ОператорИмя,
        |		История.ТекстЦитирования КАК ТекстЦитирования,
        |		История.АвторЦитирования КАК АвторЦитирования,
        |		История.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
        |		История.ВременнаяМетка КАК ВременнаяМетка,
        |		История.ПрочитаноОператором КАК ПрочитаноОператором,
        |		История.ЕстьФайл КАК ЕстьФайл
        |	ИЗ
        |		РегистрСведений.iga_ИсторияСообщений КАК История
        |	ГДЕ
        |		История.Чат = &Чат
        |	
        |	УПОРЯДОЧИТЬ ПО
        |		ВременнаяМетка УБЫВ) КАК ВложенныйЗапрос
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПрикрепленныеФайлы КАК iga_ПрикрепленныеФайлы
        |		ПО ВложенныйЗапрос.IDСообщения = iga_ПрикрепленныеФайлы.IDСообщения
        |
        |УПОРЯДОЧИТЬ ПО
        |	ВременнаяМетка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "999", КоличествоСообщений);
        
    Запрос.УстановитьПараметр("Чат", ЧатСсылка);
    Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДанных = Новый Массив;
    ТекущаяВременнаяМетка = 0;
    
    Пока Выборка.Следующий() Цикл
        
        ТекущаяВременнаяМетка = Выборка.ВременнаяМетка;
		
		ТекстСообщения = Выборка.Текст;
		
		ПараметрыJS = Новый Структура;
		
		Если Выборка.ЕстьФайл Тогда
            ПараметрыJS.Вставить("hasFile",    Истина);
            ПараметрыJS.Вставить("fileName",   Выборка.ИмяФайла);
            ПараметрыJS.Вставить("thumbnail",  СтрЗаменить(СтрЗаменить(Выборка.КартинкаФайла, Символы.ПС, ""), Символы.ВК, ""));
            
            КлассИконки = "icon-save";
            Если Выборка.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Картинка") Тогда
                КлассИконки = "icon-zoom";
				ТекстСообщения = ?(ТекстСообщения = "", "Изображение", ТекстСообщения);
            ИначеЕсли Выборка.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") 
                ИЛИ Выборка.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Аудио") Тогда
				КлассИконки = "icon-play";
				Если Выборка.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") Тогда 
					ТекстСообщения = ?(ТекстСообщения = "", "Видеозапись", ТекстСообщения);
				Иначе
					ТекстСообщения = ?(ТекстСообщения = "", "Аудиозапись", ТекстСообщения);
				КонецЕсли;
				
			Иначе
				ТекстСообщения = ?(ТекстСообщения = "", "Документ", ТекстСообщения);
			КонецЕсли;
            ПараметрыJS.Вставить("iconClass", КлассИконки);
        КонецЕсли;
		
        ПараметрыJS.Вставить("id",           Выборка.IDСообщения);
        ПараметрыJS.Вставить("text",         ТекстСообщения);
        ПараметрыJS.Вставить("isIncoming",   Выборка.ЭтоВходящее);
        ПараметрыJS.Вставить("time",         Формат(Выборка.Дата, "ДЛФ=DT"));
        ПараметрыJS.Вставить("quoteText",    Выборка.ТекстЦитирования);
        ПараметрыJS.Вставить("quoteAuthor",  Выборка.АвторЦитирования);
        ПараметрыJS.Вставить("operatorName", Выборка.ОператорИмя);
        ПараметрыJS.Вставить("isHistory",    Истина);

        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, ПараметрыJS);
        СтрJSON = ЗаписьJSON.Закрыть();

		СтруктураСообщения = Новый Структура;
        СтруктураСообщения.Вставить("IDСообщения", Выборка.IDСообщения);
        СтруктураСообщения.Вставить("ВременнаяМетка", Выборка.ВременнаяМетка);
        СтруктураСообщения.Вставить("Текст", ТекстСообщения);
        СтруктураСообщения.Вставить("Автор", ?(Выборка.ЭтоВходящее, "Клиент", "Вы"));
        СтруктураСообщения.Вставить("ТекстЦитирования", Выборка.ТекстЦитирования);
        СтруктураСообщения.Вставить("АвторЦитирования", Выборка.АвторЦитирования);
        СтруктураСообщения.Вставить("IDЦитируемогоСообщения", Выборка.IDЦитируемогоСообщения);
        СтруктураСообщения.Вставить("ПрочитаноОператором", Выборка.ПрочитаноОператором);
		СтруктураСообщения.Вставить("ПараметрыJS", ПараметрыJS);
        МассивДанных.Добавить(СтруктураСообщения);
		
   КонецЦикла;    
    
    Результат = Новый Структура;
    Результат.Вставить("HTML", HTML_Код);
    Результат.Вставить("ТекущаяВременнаяМетка", ТекущаяВременнаяМетка);
    Результат.Вставить("МассивДанных", МассивДанных);
	
    Возврат Результат;

КонецФункции

Функция ПолучитьДвоичныеДанныеФайла(IDСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.ДанныеФайла,
	|	Файлы.ПутьКФайлу,
	|	Файлы.ТипМедиа
	|ИЗ
	|	РегистрСведений.iga_ПрикрепленныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.IDСообщения = &IDСообщения";
	
	Запрос.УстановитьПараметр("IDСообщения", IDСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанные = Неопределено;
	
	ДвоичныеДанные = Выборка.ДанныеФайла.Получить();
	
	Если ДвоичныеДанные = Неопределено И ЗначениеЗаполнено(Выборка.ПутьКФайлу) Тогда
		
		ТипХранилища = Константы.iga_ТипХранилищаФайлов.Получить();
		БазовыйПуть  = Константы.iga_ПутьККаталогуФайлов.Получить();
		
		Если ТипХранилища = ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.ЛокальныйКаталог") Тогда
			
			ПолныйПуть = БазовыйПуть + ?(Прав(БазовыйПуть, 1) = "\", "", "\") + Выборка.ПутьКФайлу;
			
			ФайлОбъект = Новый Файл(ПолныйПуть);
			Если ФайлОбъект.Существует() Тогда
				ДвоичныеДанные = Новый ДвоичныеДанные(ПолныйПуть);
			КонецЕсли;
			
		ИначеЕсли ТипХранилища = ПредопределенноеЗначение("Перечисление.iga_ТипыХранилищФайлов.FTP") Тогда
			
			ДвоичныеДанные = ПолучитьДвоичныеДанныеСФТП(БазовыйПуть, Выборка.ПутьКФайлу);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	Результат.Вставить("ТипМедиа",       Выборка.ТипМедиа);
	
	Возврат Результат;

КонецФункции

Функция ПолучитьДвоичныеДанныеСФТП(Сервер, ПутьКФайлу)
	
	Попытка
		Соединение = Новый FTPСоединение(
			Сервер, 
			Константы.iga_ПортFTP.Получить(), 
			Константы.iga_ПользовательFTP.Получить(), 
			Константы.iga_ПарольFTP.Получить(), , 
			Константы.iga_ИспользоватьБезопасноеСоединениеFTP.Получить()
		);
		
		ВременныйФайл = ПолучитьИмяВременногоФайла();
		Соединение.Получить(ПутьКФайлу, ВременныйФайл);
		
		Данные = Новый ДвоичныеДанные(ВременныйФайл);
		УдалитьФайлы(ВременныйФайл);
		
		Возврат Данные;
	Исключение
		ЗаписьЖурналаРегистрации("WhatsApp.Медиа", УровеньЖурналаРегистрации.Ошибка, , , 
			"Ошибка получения файла с FTP: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура ПеренестиФайлыВХранилище() Экспорт
    
    ТипХранилища = Константы.iga_ТипХранилищаФайлов.Получить();
    БазовыйПуть  = Константы.iga_ПутьККаталогуФайлов.Получить();
    
    Если ПустаяСтрока(БазовыйПуть) И ТипХранилища <> Перечисления.iga_ТипыХранилищФайлов.FTP Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 20
    |	Файлы.IDСообщения КАК IDСообщения,
    |	Файлы.ДанныеФайла КАК ДанныеФайла,
    |	Файлы.ИмяФайла КАК ИмяФайла,
    |	ЕСТЬNULL(iga_ИсторияСообщений.ДатаСообщения, НЕОПРЕДЕЛЕНО) КАК ДатаСообщения
    |ИЗ
    |	РегистрСведений.iga_ПрикрепленныеФайлы КАК Файлы
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
    |		ПО Файлы.IDСообщения = iga_ИсторияСообщений.IDСообщения
    |ГДЕ
    |	Файлы.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОбработкиФайлов.Загружен)";

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        
        ДвоичныеДанные = Выборка.ДанныеФайла.Получить(); 
        Если ДвоичныеДанные = Неопределено Тогда 
            Продолжить; 
        КонецЕсли;

        Успешно = Ложь;
		
		ДатаЗаписи = ?(Выборка.ДатаСообщения = Неопределено, ТекущаяДата(), Выборка.ДатаСообщения);
		
		ИмяФайла = iga_ОбщегоНазначенияКлиентСервер.ИдеальноеИмяФайла(Выборка.ИмяФайла);
		
        ОтносительныйПуть = Формат(ДатаЗаписи, "ДФ=yyyy\\MM\\dd") + "\" + Выборка.IDСообщения + "_" + ИмяФайла;

        Если ТипХранилища = Перечисления.iga_ТипыХранилищФайлов.FTP Тогда
            Успешно = СохранитьНаFTP(ДвоичныеДанные, ОтносительныйПуть);
        Иначе 
            Успешно = СохранитьВПапку(ДвоичныеДанные, БазовыйПуть, ОтносительныйПуть);
        КонецЕсли;

        Если Успешно Тогда
            Менеджер = РегистрыСведений.iga_ПрикрепленныеФайлы.СоздатьМенеджерЗаписи();
            Менеджер.IDСообщения = Выборка.IDСообщения;
            Менеджер.Прочитать();
            
            Если Менеджер.Выбран() Тогда
                Менеджер.ПутьКФайлу  = ОтносительныйПуть; 
                Менеджер.ДанныеФайла = Новый ХранилищеЗначения(Неопределено); 
                Менеджер.Статус      = Перечисления.iga_СтатусыОбработкиФайлов.Обработан; 
                Менеджер.Записать();
            КонецЕсли;
        КонецЕсли;
        
    КонецЦикла;

КонецПроцедуры

Функция СохранитьВПапку(Данные, База, Путь)
    ПолныйПуть = База + ?(Прав(База, 1) = "\", "", "\") + Путь;
    Каталог = Лев(ПолныйПуть, СтрНайти(ПолныйПуть, "\", НаправлениеПоиска.СКонца));
    СоздатьКаталог(Каталог);
    
    Попытка
        Данные.Записать(ПолныйПуть);
        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции

Функция СохранитьНаFTP(Данные, Путь)
	Попытка
		
		Сервер = Константы.iga_ПутьККаталогуФайлов.Получить();
		
		Пользователь = Константы.iga_ПользовательFTP.Получить();
		Пароль = Константы.iga_ПарольFTP.Получить();
		
        Соединение = Новый FTPСоединение(Сервер,, Пользователь, Пароль,, Истина);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Данные.Записать(ИмяВременногоФайла);

		Соединение.Записать(ИмяВременногоФайла, Путь);
		
        Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
        Возврат Ложь;
    КонецПопытки;
КонецФункции
